PKS1C/src/InformationRegisters/ИсторияИзмененийДокументов/ИсторияИзмененийДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИзмененийДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ДневнойОтчетПочасовыхРабот</types>
      <types>DocumentRef.ДоговорОбслуживания</types>
      <types>DocumentRef.НормаРабот</types>
      <types>DocumentRef.СменаДатКлючевыхНосителей</types>
      <types>DocumentRef.ПоступлениеЛицензий</types>
      <types>DocumentRef.РеализацияЛицензий</types>
      <types>EnumRef.СтатусыРегистрацииККТ</types>
      <types>DocumentRef.ЗаявкиКлиентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/CommonModules/АутсорсФункцииДокументовСервер/Module.bsl
//Фиксирует автора изменений документа
Процедура УстановитьИзменениеДокумента(Документ) Экспорт
	ДатаИзменения = ТекущаяДата();
	НаборЗаписей = РегистрыСведений.ИсторияИзмененийДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	НаборЗаписей.Отбор.Период.Установить(ДатаИзменения);
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ДатаИзменения;
	Запись.Документ = Документ;
	Запись.Автор = Пользователи.АвторизованныйПользователь();
	НаборЗаписей.Записать();
КонецПроцедуры
